# Novos Valores

In [1]:
import  pandas as pd

In [2]:
dados = pd.read_csv('dados/aluguel_residencial.csv', sep=";")
dados.head()

,Unnamed: 0,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN
2,3,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
3,4,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN
4,5,Apartamento,Vista Alegre,3,1,0,70,1200.0,NaN,NaN

In [3]:
dados['Valor Bruto'] = dados['Valor'] + dados['Condominio'] + dados ['IPTU']

In [4]:
dados.head()

,Unnamed: 0,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU,Valor Bruto
0,0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0,2260.0
1,1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN,NaN
2,3,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0,1210.0
3,4,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN,NaN
4,5,Apartamento,Vista Alegre,3,1,0,70,1200.0,NaN,NaN,NaN

In [5]:
dados['Valor m2'] = dados['Valor'] / dados['Area']

In [6]:
dados['Valor m2'] = dados['Valor m2'].round(2)
dados

,Unnamed: 0,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU,Valor Bruto,Valor m2
0,0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0,2260.0,42.50
1,1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN,NaN,70.00
2,3,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0,1210.0,53.33
3,4,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN,NaN,16.67
4,5,Apartamento,Vista Alegre,3,1,0,70,1200.0,NaN,NaN,NaN,17.14
...,...,...,...,...,...,...,...,...,...,...,...,...
22575,32953,Apartamento,Méier,2,0,0,70,900.0,490.0,48.0,1438.0,12.86
22576,32955,Quitinete,Centro,0,0,0,27,800.0,350.0,25.0,1175.0,29.63
22577,32956,Apartamento,Jacarepaguá,3,1,2,78,1800.0,800.0,40.0,2640.0,23.08
22578,32957,Apartamento,São Francisco Xavier,2,1,0,48,1400.0,509.0,37.0,1946.0,29.17
22579,32958,Apartamento,Leblon,2,0,0,70,3000.0,760.0,NaN,NaN,42.86

In [7]:
dados['Valor Bruto m2'] = (dados['Valor Bruto'] / dados['Area']).round(2)
dados

,Unnamed: 0,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU,Valor Bruto,Valor m2,Valor Bruto m2
0,0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0,2260.0,42.50,56.50
1,1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN,NaN,70.00,NaN
2,3,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0,1210.0,53.33,80.67
3,4,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN,NaN,16.67,NaN
4,5,Apartamento,Vista Alegre,3,1,0,70,1200.0,NaN,NaN,NaN,17.14,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
22575,32953,Apartamento,Méier,2,0,0,70,900.0,490.0,48.0,1438.0,12.86,20.54
22576,32955,Quitinete,Centro,0,0,0,27,800.0,350.0,25.0,1175.0,29.63,43.52
22577,32956,Apartamento,Jacarepaguá,3,1,2,78,1800.0,800.0,40.0,2640.0,23.08,33.85
22578,32957,Apartamento,São Francisco Xavier,2,1,0,48,1400.0,509.0,37.0,1946.0,29.17,40.54
22579,32958,Apartamento,Leblon,2,0,0,70,3000.0,760.0,NaN,NaN,42.86,NaN

In [8]:
casa  = ['Casa', 'Casa de Condomínio','Casa de Vila']

In [9]:
dados['Tipo Agregado'] = dados['Tipo'].apply(lambda x: 'Casa' if x in casa else 'Apartamento')

In [10]:
dados

,Unnamed: 0,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU,Valor Bruto,Valor m2,Valor Bruto m2,Tipo Agregado
0,0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0,2260.0,42.50,56.50,Apartamento
1,1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN,NaN,70.00,NaN,Casa
2,3,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0,1210.0,53.33,80.67,Apartamento
3,4,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN,NaN,16.67,NaN,Apartamento
4,5,Apartamento,Vista Alegre,3,1,0,70,1200.0,NaN,NaN,NaN,17.14,NaN,Apartamento
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
22575,32953,Apartamento,Méier,2,0,0,70,900.0,490.0,48.0,1438.0,12.86,20.54,Apartamento
22576,32955,Quitinete,Centro,0,0,0,27,800.0,350.0,25.0,1175.0,29.63,43.52,Apartamento
22577,32956,Apartamento,Jacarepaguá,3,1,2,78,1800.0,800.0,40.0,2640.0,23.08,33.85,Apartamento
22578,32957,Apartamento,São Francisco Xavier,2,1,0,48,1400.0,509.0,37.0,1946.0,29.17,40.54,Apartamento
22579,32958,Apartamento,Leblon,2,0,0,70,3000.0,760.0,NaN,NaN,42.86,NaN,Apartamento

In [11]:
dados.dropna(subset=['Condominio'], inplace= True)

In [12]:
dados.dropna(subset=['IPTU'], inplace=True)

In [13]:
#dados.dropna(subset=['Valor'], inplace=True)
dados.dropna(subset=['Valor Bruto'], inplace=True)
dados.dropna(subset=['Valor m2'], inplace=True)
dados.dropna(subset=['Valor Bruto m2'], inplace=True)

In [14]:
dados.isnull().sum()

Unnamed: 0        0
Tipo              0
Bairro            0
Quartos           0
Vagas             0
Suites            0
Area              0
Valor             0
Condominio        0
IPTU              0
Valor Bruto       0
Valor m2          0
Valor Bruto m2    0
Tipo Agregado     0
dtype: int64

In [15]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 15346 entries, 0 to 22578
Data columns (total 14 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Unnamed: 0      15346 non-null  int64
 1   Tipo            15346 non-null  object
 2   Bairro          15346 non-null  object
 3   Quartos         15346 non-null  int64
 4   Vagas           15346 non-null  int64
 5   Suites          15346 non-null  int64
 6   Area            15346 non-null  int64
 7   Valor           15346 non-null  float64
 8   Condominio      15346 non-null  float64
 9   IPTU            15346 non-null  float64
 10  Valor Bruto     15346 non-null  float64
 11  Valor m2        15346 non-null  float64
 12  Valor Bruto m2  15346 non-null  float64
 13  Tipo Agregado   15346 non-null  object
dtypes: float64(6), int64(5), object(3)
memory usage: 1.8+ MB